<!-- dflook/terraform-github-actions {"workspace":"default","backend_type":"gcs","backend":"dd2d31986f4b5579ad90b6ff6214a61bcd13256aae5f95a43b8b8ac62d18bf34","plan_job_ref":"Job Plan Airflow DAGs #360 at https://github.com/cal-itp/data-infra/actions/runs/16382500368","plan_out_hash":"b842c7ee8afc52b643326db904c034384588aca5b205023ebfa9035d13c13074","plan_hash":"c6fae85d418d0f1bec72c7204fd970632cdb0875e266bcde80777c7314057ed7","plan_text_format":"diff","version":"1.49.0"} -->
Terraform plan in __iac/cal-itp-data-infra/airflow/us__
<details>
<summary>Plan: 0 to add, 6 to change, 0 to destroy.</summary>

```diff
Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
!~  update in-place

Terraform will perform the following actions:

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/gtfs_quality/guidelines_checks/int_gtfs_quality__wheelchair_accessible_trips.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "WR6pEA==" -> (known after apply)
!~      detect_md5hash      = "nJ9xB2ozWMaR6xs1DeRLIA==" -> "different hash"
!~      generation          = 1751416666230826 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/intermediate/gtfs_quality/guidelines_checks/int_gtfs_quality__wheelchair_accessible_trips.sql"
!~      md5hash             = "nJ9xB2ozWMaR6xs1DeRLIA==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs_quality/guidelines_checks/int_gtfs_quality__wheelchair_accessible_trips.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/gtfs_quality/guidelines_checks/int_gtfs_quality__wheelchair_boarding_stops.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "W4SD3A==" -> (known after apply)
!~      detect_md5hash      = "gu3rnxIpcFsHvV/Lr2S6QA==" -> "different hash"
!~      generation          = 1751416669210238 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/intermediate/gtfs_quality/guidelines_checks/int_gtfs_quality__wheelchair_boarding_stops.sql"
!~      md5hash             = "gu3rnxIpcFsHvV/Lr2S6QA==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs_quality/guidelines_checks/int_gtfs_quality__wheelchair_boarding_stops.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/gtfs_quality/int_gtfs_quality__guideline_checks_index.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "RmHaXA==" -> (known after apply)
!~      detect_md5hash      = "cov8NZ39r3bN24BNoIowSg==" -> "different hash"
!~      generation          = 1751416666639335 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/intermediate/gtfs_quality/int_gtfs_quality__guideline_checks_index.sql"
!~      md5hash             = "cov8NZ39r3bN24BNoIowSg==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs_quality/int_gtfs_quality__guideline_checks_index.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/intermediate/gtfs_quality/int_gtfs_quality__guideline_checks_long.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "Vnalzg==" -> (known after apply)
!~      detect_md5hash      = "+NXlwO3+8vkrZP7xgcLEMA==" -> "different hash"
!~      generation          = 1751416662567518 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/intermediate/gtfs_quality/int_gtfs_quality__guideline_checks_long.sql"
!~      md5hash             = "+NXlwO3+8vkrZP7xgcLEMA==" -> (known after apply)
        name                = "data/warehouse/models/intermediate/gtfs_quality/int_gtfs_quality__guideline_checks_long.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs_quality/fct_daily_organization_combined_guideline_checks.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "uEJ7aQ==" -> (known after apply)
!~      detect_md5hash      = "XjTXI/ExBt3IaIBD0R/8Pg==" -> "different hash"
!~      generation          = 1751416669417790 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs_quality/fct_daily_organization_combined_guideline_checks.sql"
!~      md5hash             = "XjTXI/ExBt3IaIBD0R/8Pg==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs_quality/fct_daily_organization_combined_guideline_checks.sql"
#        (17 unchanged attributes hidden)
    }

  # google_storage_bucket_object.calitp-composer-dags["models/mart/gtfs_quality/fct_monthly_reports_site_organization_guideline_checks.sql"] will be updated in-place
!~  resource "google_storage_bucket_object" "calitp-composer-dags" {
!~      crc32c              = "X5fZ0g==" -> (known after apply)
!~      detect_md5hash      = "V7gP6ICByPI1+OiWhDggdw==" -> "different hash"
!~      generation          = 1751416661419869 -> (known after apply)
        id                  = "calitp-composer-data/warehouse/models/mart/gtfs_quality/fct_monthly_reports_site_organization_guideline_checks.sql"
!~      md5hash             = "V7gP6ICByPI1+OiWhDggdw==" -> (known after apply)
        name                = "data/warehouse/models/mart/gtfs_quality/fct_monthly_reports_site_organization_guideline_checks.sql"
#        (17 unchanged attributes hidden)
    }

Plan: 0 to add, 6 to change, 0 to destroy.
```
</details>

:memo: Plan generated in [Plan Airflow DAGs #360](https://github.com/cal-itp/data-infra/actions/runs/16382500368)